el_rad=float(input("Введіть частоту радіації в Гц: "))
if el_rad<3*10**9:
    print("Частота радіації відповідає радіохвилям")
elif el_rad>3*10**9 and el_rad<3*10**12:
     print("Частота радіації відповідає мікрохвилям")
elif el_rad>3*10**12 and el_rad<4.3*10**14:
      print("Частота радіації відповідає інфрачервоному світлу")
elif el_rad>4.3*10**14 and el_rad<7.5*10**14:
      print("Частота радіації відповідає видимому світлу")
elif el_rad>7.5*10**14 and el_rad<3*10*17:
      print("Частота радіації відповідає ультрафіолету")
elif el_rad>3*10**17 and el_rad<3*10**19:
      print("Частота радіації відповідає рентгенівським променям")
else:  print("Частота радіації відповідає гамма-променям")